In [1]:
#Pandas is a powerful, open-source Python library used for data manipulation, cleaning, and analysis

In [2]:
import pandas as pd

In [3]:
s= pd.Series([2,4,5,6])
print(s)

0    2
1    4
2    5
3    6
dtype: int64

In [4]:
#You can also define custom index:

s = pd.Series([10, 20, 30], index=["a", "b", "c"])
print(s)

a    10
b    20
c    30
dtype: int64

In [6]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

df = pd.DataFrame(data)
print(df)

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [9]:
df.index         # Row labels

RangeIndex(start=0, stop=3, step=1)

In [8]:
df.columns       # Column labels

Index(['name', 'age', 'city'], dtype='object')

In [10]:
# Different ways to create a pandas Dataframe

data = [
    ["Alice", 25],
    ["Bob", 30],
    ["Charlie", 35]
]
 
df = pd.DataFrame(data, columns=["Name", "Age"])
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [11]:
# By using Numpy arrays
import numpy as np

arr = np.array([[1, 2], [3, 4]])
df = pd.DataFrame(arr, columns=["A", "B"])

In [12]:
df

   A  B
0  1  2
1  3  4

In [15]:
df1=pd.read_excel("data.xlsx")

In [16]:
df1

      Name School  Marks
0  Shubham    SPS     56
1   Joshua   UPES     77
2     Jack    LPU     45
3     Alex    RIT     67
4    Rishi    NIT     78
5    Akash    RTS     90

In [19]:
df.head()

   A  B
0  1  2
1  3  4

In [ ]:
     
df.tail()         # Last 5 rows
df.info()         # Column info: types, non-nulls
df.describe()     # Stats for numeric columns
df.columns        # List of column names
df.shape          # (rows, columns)

In [20]:
df.describe()

              A         B
count  2.000000  2.000000
mean   2.000000  3.000000
std    1.414214  1.414214
min    1.000000  2.000000
25%    1.500000  2.500000
50%    2.000000  3.000000
75%    2.500000  3.500000
max    3.000000  4.000000

In [21]:
df.columns

Index(['A', 'B'], dtype='object')